import { flipH, type Sprite } from '../sprite';
import { art } from './pix';

// Игрок: киборг 12×16 в длинном плаще, шлем с жёлтым визором, хромированная правая рука.
// Цифры/буквы — индексы палитры; обводка цветом 0 добавляется автоматически.

const FRONT = [
  '............',
  '....5554....',
  '...455543...',
  '...4eeed3...',
  '...342232...',
  '.674aa99332.',
  '.564a413232.',
  '.6749413242.',
  '.56cdc1cc32.',
  '.7644413221.',
  '...443132...',
];
const BACK = [
  '............',
  '....5554....',
  '...455543...',
  '...454443...',
  '...332232...',
  '.324aa99376.',
  '.324a433265.',
  '.4249cd3276.',
  '.32ccccc265.',
  '.1244433267.',
  '...443132...',
];
const LEGS_FB = [
  ['...21..21...', '...32..32...', '...32..32...', '...54..54...'],
  ['...21..21...', '...32..32...', '...54..32...', '.......54...'],
  ['...21..21...', '...32..32...', '...32..54...', '...54.......'],
];
const SIDE = [
  '............',
  '.....5554...',
  '....455543..',
  '....4443ee..',
  '....343322..',
  '...9aa9432..',
  '...946732...',
  '....45632...',
  '....c67dc...',
  '....47632...',
  '...443322...',
];
const LEGS_SIDE = [
  ['.....32.....', '.....32.....', '.....32.....', '.....554....'],
  ['....3222....', '....32.32...', '...32...32..', '...55...554.'],
  ['.....322....', '.....3243...', '.....32.54..', '.....554....'],
];

export interface DirFrames {
  down: Sprite[];
  up: Sprite[];
  right: Sprite[];
  left: Sprite[];
}

export function playerArt(): DirFrames {
  const mk = (top: string[], legs: string[][]) => legs.map((l) => art([...top, ...l, '............']));
  const right = mk(SIDE, LEGS_SIDE);
  return { down: mk(FRONT, LEGS_FB), up: mk(BACK, LEGS_FB), right, left: right.map(flipH) };
}
